# StairsLandingtypeHasMonolithicSupport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsLandingtypeHasMonolithicSupport Property
ParameterTypeId Class See Also
---
"Monolithic Support": Monolithic Support
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsLandingtypeHasMonolithicSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsLandingtypeHasMonolithicSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsLandingtypeHasMonolithicSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace